"""
객채의 모든 것
가장 중요 : 값(attribute), 과 속성(method)
종류(type)와 위치주소(id)
들여다보기 : 기능나열(dir), 디렉토리의 약자(DIRectory)
객채 전체 오버뷰(둘러보기) : help
"""


def test1():
    def show_id(_a, _b, _c):
        """ 함수의 인자 = 파라미터 / 파라미터 --> 내부변수에 전달 (지역변수)
          - 파라미터와 내부변수는 다르다 / 함수가 닫히면 내부변수(지역변수)는 사라진다.
        """
        print()
        # print('_a =', id(_a), '-->', _a)
        print('_a = {} --> {}'.format(id(_a), _a))
        print('_b = {} --> {}'.format(id(_b), _b))
        print('_c = {} --> {}'.format(id(_c), _c))
""" 문제3. IF 분기 문제 - 99병의 맥주 ( 변경: 맥주 -> ?? )
미국과 캐나다 등에서 자주 불리는 권주가(勸酒歌). 벽장에 있는 99개의 맥주병을
하나씩 꺼내면서 수가 줄어드는 걸 노래하고 있다. 가사는 긴 주제에 무지무지 외우기가
쉽기 때문에 주로 긴 여행길에서 할 일 없을 때 부르거나 하는 노래다.

- 99병의 맥주들이 벽에 있네~, 99병의 맥주들이 벽에 있네~
- 이제 한 병을 내려 마셨네~,  98병의 맥주들이 벽에 있네~
- -----------------------
- 1병의 맥주(들이x)가 벽에 있네~, 1병의 맥주가 벽에 있네~
- 이제 한 병을 내려 마셨네~,         ..........
- -----------------------
- 더 이상 벽에는 맥주가 없네~, 더 이상 벽에는 맥주가 없네~
- 더 하시겠 습니까? (Yes=Enter / No=Space+Enter )?
- -----------------------

- 더 이상 벽에는 맥주가 없네~, 더 이상 벽에는 맥주가 없네~
- 가게에 나가서 맥주를 사왔네, 99병의 맥주들이 벽에 있네~
- -----------------------
- (반복)
타잔 빤쓰와 비슷하지만 복수<->단수, 가사변경을 오가며 바뀌는 것이
IF문을 연습하기 좋아서 HELLO WORLD 만큼 유명한 문제.
"""

beers = """병의 맥주들이 벽에 있네~"""
beer = """병의 맥주가 벽에 있네~"""
minus = """이제 한 병을 내려마셨네~"""
beer_num = 10

for n in range(10):
    print(beer_num, beers, beer_num, beers)
    beer_num-=1
    print(minus, beer_num, beers)

    if beer_num==1:
        print(beer_num, beer, beer_num, beer, '\n', minus)
